#libs
import cv2
import torch
from ultralytics import YOLO
from tests import CameraYolo
from matplotlib import pyplot as plt
import random, time
import winsound
import numpy as np

names = [
    "Туго Серя",
    "Сын Берёзы",
    "Серёга Курган",
    "Хлоп Хлоп",
    "унитазный элементаль228",
    "коллекционер баребухов",
    "сектор пудж",
    "олежа трансмиссия",
    "шиноби скрытого пула",
    "буханка пива",
    "пт на клизму",
    "синичка без яичка",###
    "Паша",
    "Байландо амигос",
    "САНЯХУСКАР2007",
    "Водитель (по губам)",
    "Умножитель на 0",
    "ВасяБлэкхол",
    "МАГА - БЛИНК ДАГАААА",
    "Валера-хроносфера",
    "Юра-фисура",
    "пУта.ю кН0пкИ",
    "сын твоей мамы",
    "Кусок овчарки",
    "ВованНамберВан",
    "ТурбоПудж2007рус",
    "КМС ПО ПРОЁБУ ПТС",
    "Гондольер",
    "Пожилая кикимбала",
    "Пуджак",
    "Only69pos",
    "БЕсеДЫ С БАтюШКОЙ",
    "stray228",
    "ZXC Lobby God",
    "dead inside (16 y. o.)",
    "Pudge inside",
    "Бразый из лысерс",
    "ашот шейклшот",
    "аллах на тревелах",
    "Метр с кепкой",
    "Tiny Airlines",
    "Жан Клод вам бан",
    "Газировочник",
    "ПЬЕР Д'АЧЕЛЛО",
    "ДиноЗаур",
    "Сбежал с дурки",
    "КМС ПО ФИДУ",
    "Паджиро",
    "ЦЫGAN",
    "ПИВО РЕАРМ ПИВО",
    "Дристлбэк",
    "пивной элементаль",
    "Гена Цидармян",
    "YATOGOROT",
    "Наташа 2 баша",
    "Замир Безгеев",
    "Чё срал звалк?",
    "Солевой сомелье",
    "Стоша гoвназад",
    "Матье Бал",
    "Закись Ашота",
    "spidor-man",
    "Lesbian commander",
    "Паджеро спорт",
    "Насрал в плафон",
    "Кмс по пмс",
    "Блинк на кухню",
    "волк из лузстрит",
    "Куртка Бэйна",
    "Сын Фермера",
    "Ra$PizDAY",
    "причина тараски",
    "3 яйца 4 огурца",
    "я хамстер",
    "ашкьюдишкинс",
    "ябида карябида",
    "диджей Чопчоп",
    "хамстэр криминал",
    "плей маркет",
    "света 300м от вас",
    "Восьмиклассница",
    "Чертополох",
    "Трепло кукрузное",
    "витя камушкин",
    "Саня сигма гуччи",
    "маша дезолятор",
    "Тяжело 116 IQ",
    "Тролямба",
    "Autism+",
    "Ессентуки №17",
    "Майор Доиграллес",
    "Мышелов - крысабор",
    "Купентий))))",
    "Кефтемен",
    "Накурыш Старший",
    "Тильтасьён",
    "ФК Махачкалинские Кайфарики",
    "лысый из марвел",
    "Рофлокоптер",
    "людмила пална",
    "причина πТараски",
    "Я знал что ей 72 но...",
    "Лена 3Б",
    "Усатая Баба Капа",
    "АЛЬБАТРОС2011",
    "ПУСТОМЕЛЯ",
    "ban pudge = loss",
    "ВАНЯ ЮВЕЛИР",
    "nubachyo.",
    "Пердёжонок",
    "чешки месси.",
    "Куннка_В_Трениках",
    "Сатору Гойда",
    "Роберт ПОПсон",
    "Натуральный Гей",
    "ПринцПенсии"
    "старый бот",
    "анкара месси",
    "ПОЛМАТЕРИ",
    "бегущий по лесбию",
    "Воспитатель Детдома",
    "КуZя СОЛЬ ツ",
    "Агент Габена",
    "АНГЕЛ-ПРЕДОХРАНИТЕЛЬ",
    "Дьявол Носит Demix",
    "метр с кепкой",
    "мальчик с пальчик",
    "300 Трактористов",
    "Христос байбэк",
    "Добропар Жижедуй",
    "Чел из Бздыщево",
    "Пьер Дун",
    "Потный Лавандышь",
    "устуПИ ДОРогу",
    "генерал машонка",
    "Задоджил Ирак",
    "санстрайк в коляску",
    "стив футджобс",
    "кефирные яйца007",
    "турбо наггетс",
    "скибиди чайник",
    "БАРАК БАНАНА",
    "ОчкоТоварища",
    "ШаПунишка",
    "Шакил О'нал",
    "Фантом Отсасин",
    "МОЗГ РАКА",
    "ГНОМ-ХУЕКРАДчик",
    "ZXChuchelo",
    "Сынсо Баки",
    "ЧИВАПЧИЧИ",
    "Гриша Подшипник",
    "pounce в окно",
    "ОперУпалНамоченый",
    "qcold",
    "Тепло твоего деда",
    "Топ 1 Ирака",
    "Сквиртонит",
    "Тарас Вульва",
    "Бескрайняя плоть",
    "Голос пятерочки",
    "Игрушка отчими",
    "Антинатурал",
    "zxcpedrila",
    "устал ВЫИГРЫВАТЬ",
    "Bombardiro Crocodilo",
    "Bombombini Gusini",
    "Bobritto Bandito",
    "Chimpanzini Bananini",
    "Orangutini Ananasini",
    "Penguinator Termoregulator",
    "ПродамПочку",
    "Блатной попрошайка",
    "Жигулист",
    "Охранник ммр",
    "ФранКенШкет",
    "Дикпиковая дама",
    "Мусульманго",
    "ZXC_Фугасом полбу",
    "SKUFF (e)BASHER",
    "пiстолс",
    "АльтушкаАлексей",
    "мопед на морфе",
    "Бедный Еврей",
    "диз канект",
    "штаны с hellokitty",
    "Ваня гайка",
    "sosok oslihi",
    "Злой димедрол",
    "НачальникГолубей",
    "на колени олени",
    "Фатима Борисовна",
    "блоу джобсон",
    "тру кён канеки",
    "шмебупели",
    "Сын Миража",
    "Жанклод вантап",]
# Загрузка модели

import cv2


class RECOGNITION:
    def __init__(self):
        self.mode = int(input("Choose expected person quantity:" ))
        self.choice = int(input("Choose expected person that must be chosen: " ))
        if not type(self.mode) == int:
            print("INVALID")
            return
        self.camera = CameraYolo()
        self.model = YOLO("yolo26l.pt", task="detect")
        ru_names = {
            0: "Двуногий",
            1: "велосипед",
            2: "машина",
            3: "мотоцикл",
            4: "самолёт",
            5: "автобус",
            6: "поезд",
            7: "грузовик",
            8: "лодка",
            9: "светофор",
            10: "гидрант",
            11: "знак стоп",
            12: "паркомат",
            13: "скамейка",
            14: "птица",
            15: "кошка",
            16: "собака",
            17: "лошадь",
            18: "овца",
            19: "корова",
            20: "слон",
            21: "медведь",
            22: "зебра",
            23: "жираф",
            24: "рюкзак",
            25: "зонт",
            26: "сумка",
            27: "галстук",
            28: "чемодан",
            29: "фрисби",
            30: "лыжи",
            31: "сноуборд",
            32: "мяч",
            33: "воздушный змей",
            34: "бейсбольная бита",
            35: "бейсбольная перчатка",
            36: "скейтборд",
            37: "сёрфборд",
            38: "теннисная ракетка",
            39: "бутылка",
            40: "бокал",
            41: "чашка",
            42: "вилка",
            43: "нож",
            44: "ложка",
            45: "миска",
            46: "банан",
            47: "яблоко",
            48: "бутерброд",
            49: "апельсин",
            50: "брокколи",
            51: "морковь",
            52: "хот-дог",
            53: "пицца",
            54: "пончик",
            55: "торт",
            56: "стул",
            57: "диван",
            58: "растение в горшке",
            59: "кровать",
            60: "обеденный стол",
            61: "унитаз",
            62: "телевизор",
            63: "ноутбук",
            64: "мышь",
            65: "пульт",
            66: "клавиатура",
            67: "мобильный телефон",
            68: "микроволновка",
            69: "духовка",
            70: "тостер",
            71: "раковина",
            72: "холодильник",
            73: "книга",
            74: "часы",
            75: "ваза",
            76: "ножницы",
            77: "плюшевый мишка",
            78: "фен",
            79: "зубная щётка"
        }
        self.model.model.names = ru_names

        if torch.cuda.is_available():
            self.model.to("cuda")
    def start(self):
        for frame in self.camera.start_flow():
            res = self.model(frame)
            img = res[0].plot()

            target = 0
            cropped_img = []
            quantity = 0
            for box in res[0].boxes:
                if int(box.cls[0]) == target and box.conf[0] > 0.8:
                    quantity+=1
                    x1, y1, x2, y2 = map(int, box.xyxy[0])
                    cropped = img[y1:y2, x1:x2]
                    cropped_img.append(cropped)
            if quantity >= self.mode * 0.85:
                cols = 2
                rows = (len(cropped_img) + cols - 1) // cols

                c,axes = plt.subplots(rows,cols, figsize=(12, 4))
                namesl = {}
                for i,cropped in enumerate(cropped_img):
                    axes[i].imshow(cropped)
                    axes[i].axis('off')
                    name = random.choice(names)
                    namesl[np.array2string(cropped)] = name
                    axes[i].set_title(f"Выявленная персона: {name}")
                plt.show()
                cv2.waitKey(0)
                cv2.destroyAllWindows()

                winsound.Beep(frequency=2000,duration=500)

                c, axes = plt.subplots(rows, cols, figsize=(12, 4))
                random.shuffle(cropped_img)
                random.shuffle(cropped_img)
                random.shuffle(cropped_img)

                for i in range(self.choice):
                    c = cropped_img.pop()
                    axes[i].imshow(c)
                    axes[i].axis('off')
                    axes[i].set_title(f"Везунчик №{i+1}: {namesl[np.array2string(c)]}")
                plt.show()

                cv2.waitKey(0)
                break
            width = int(img.shape[1] * 350 / 100)
            height = int(img.shape[0] * 180 / 100)
            img_big = cv2.resize(img, (width, height), interpolation=cv2.INTER_LINEAR)
            cv2.imshow("Scaled x2", img_big)

            # cv2.imshow("frame4",res[0].plot())
            if cv2.waitKey(1) & 0xFF == ord('q'):
                cv2.destroyAllWindows()
                break
onj = RECOGNITION()
onj.start()