import base64
from io import BytesIO
from PIL import Image
import cv2
from ultralytics import YOLO

# Загрузка модели
model = YOLO("yolo26l.pt", task="detect")  # или ваш файл yolo26l.pt
labels = model.names
print("LABLES",labels)
ru_names = {
    0: "Будущий раб",
    1: "велосипед",
    2: "машина",
    3: "мотоцикл",
    4: "самолёт",
    5: "автобус",
    6: "поезд",
    7: "грузовик",
    8: "лодка",
    9: "светофор",
    10: "гидрант",
    11: "знак стоп",
    12: "паркомат",
    13: "скамейка",
    14: "птица",
    15: "кошка",
    16: "собака",
    17: "лошадь",
    18: "овца",
    19: "корова",
    20: "слон",
    21: "медведь",
    22: "зебра",
    23: "жираф",
    24: "рюкзак",
    25: "зонт",
    26: "сумка",
    27: "галстук",
    28: "чемодан",
    29: "фрисби",
    30: "лыжи",
    31: "сноуборд",
    32: "мяч",
    33: "воздушный змей",
    34: "бейсбольная бита",
    35: "бейсбольная перчатка",
    36: "скейтборд",
    37: "сёрфборд",
    38: "теннисная ракетка",
    39: "бутылка",
    40: "бокал",
    41: "чашка",
    42: "вилка",
    43: "нож",
    44: "ложка",
    45: "миска",
    46: "банан",
    47: "яблоко",
    48: "бутерброд",
    49: "апельсин",
    50: "брокколи",
    51: "морковь",
    52: "хот-дог",
    53: "пицца",
    54: "пончик",
    55: "торт",
    56: "стул",
    57: "диван",
    58: "растение в горшке",
    59: "кровать",
    60: "обеденный стол",
    61: "унитаз",
    62: "телевизор",
    63: "ноутбук",
    64: "мышь",
    65: "пульт",
    66: "клавиатура",
    67: "мобильный телефон",
    68: "микроволновка",
    69: "духовка",
    70: "тостер",
    71: "раковина",
    72: "холодильник",
    73: "книга",
    74: "часы",
    75: "ваза",
    76: "ножницы",
    77: "плюшевый мишка",
    78: "фен",
    79: "зубная щётка"
}
model.model.names = labels
# Чтение изображения
frame = cv2.imread("KOL.png")
frame1 = cv2.imread("img_1.png")
frame2 = cv2.imread("img_2.png")
# Предсказание
results = model(frame)

print(results[0].show())
results = model(frame1)

print(results[0].show())
results = model(frame2)

print(results[0].show())